{
  "mn8:0.1": "Среднее Собрание 8",
  "mn8:0.2": "Сутта Стирание (Стачивание)",
  "mn8:1.1": "Так мной услышано—",
  "mn8:1.2": "одно время Благословенный в Саватхи располагается в роще Джеты в парке Анатхапиндики.",
  "mn8:2.1": "И тогда уважаемый Махачунда вечерним временем из уединения вышедший, где Благословенный туда-подошёл; подойдя Благословенного поприветствовав с одного края сел. И с одного края сидящий уважаемый Махачунда Благословенному это сказал:",
  "mn8:3.1": "“Которые эти, почтенный, различные взгляды на свете-в мире возникают—",
  "mn8:3.2": "или с-самости-утверждением-связанные или с-мира-утверждением-связанные—",
  "mn8:3.3": "но как изначально, почтенный, монаху мыслящему-представляющему так этих взглядов есть покидание, так этих взглядов есть удаление.",
  "mn8:3.4": "“Которые эти, Чунда, различные взгляды на свете-в мире возникают—",
  "mn8:3.5": "или с-самости-утверждением-связанные или с-мира-утверждением-связанные—",
  "mn8:3.6": "как и эти взгляды возникают, как и залегают, как и выражаются то ‘это не моё, это не есть я , не моя это самость’—так это как-есть правильным пониманием видящему так этих взглядов есть покидание, так этих взглядов есть удаление.",
  "mn8:4.1": "Возможность то ведь такая, Чунда, существует когда некий (какой-нибудь один) монах именно отделившись от желаний, отделившись от неблаготворных явлений с рассуждением с выслеживанием, с упоением-приятную различением-отъединением-рожденную, первую джхану достигнув пребывал бы.",
  "mn8:4.2": "Ему так явилось бы:",
  "mn8:4.3": "‘в стирании пребываю’.",
  "mn8:4.4": "Но не эти ведь, Чунда, в благородного выведении 'стирания' называются.",
  "mn8:4.5": "В-видимой-действительности-приятно-пребывания это в благородного выведении называются.",
  "mn8:5.1": "Возможность то ведь такая, Чунда, существует когда некий монах рассуждений-выслеживаний от выравнивания, внутреннюю уверенность, ума-мышления единобытность, без рассуждения без выслеживания объединением-рожденную с упоением-приятную вторую джхану достигнув пребывает.",
  "mn8:5.2": "Ему так явилось бы:",
  "mn8:5.3": "‘в стирании пребываю’.",
  "mn8:5.4": "Но не то ведь, Чунда, в благородного выведении 'стирание' называют.",
  "mn8:5.5": "В-видимой-действительности-приятно-пребывания это в благородного выведении называются.",
  "mn8:6.1": "Возможность то ведь такая, Чунда, существует когда некий монах и от неочарованности (бесстрастия) упоением и прямо-видящий пребывал бы, и памятующий сознательлный и приятное телом изведывал бы, такого Благородные отмечают: ‘прямо-видящий, памятующий, в приятном пребывающий’ третью джану достигнув пребывал бы.",
  "mn8:6.2": "Ему так явилось бы:",
  "mn8:6.3": "‘в стирании пребываю’.",
  "mn8:6.4": "Но не эти ведь, Чунда, в благородного выведении 'стирания' называются.",
  "mn8:6.5": "В-видимой-действительности-приятно-пребывания это в благородного выведении называются.",
  "mn8:7.1": "Возможность то ведь такая, Чунда, существует когда некий монах и от покидания приятного и от покидания боли, и прежде довольств-недовольств от захождения, не-болезненную-не-приятную с-прямым-видением-памятованием-пречистую четвёртую джхану достугнув пребывал бы.",
  "mn8:7.2": "Ему так явилось бы:",
  "mn8:7.3": "‘в стирании пребываю’.",
  "mn8:7.4": "Но не эти ведь, Чунда, в благородного выведении 'стирания' называются.",
  "mn8:7.5": "В-видимой-действительности-приятно-пребывания это в благородного выведении называются.",
  "mn8:8.1": "Возможность то ведь такая, Чунда, существует когда некий монах всецело от объекто-сознаваний превосхождения, от отражения-сознаваний захождения, от разнообразности-сознавания непредставления, 'бескрайнее пространство' пространства-бескрайнего-область достигнув пребывал бы.",
  "mn8:8.2": "Ему так явилось бы:",
  "mn8:8.3": "‘в стирании пребываю’.",
  "mn8:8.4": "Но не эти ведь, Чунда, в благородного выведении 'стирания' называются.",
  "mn8:8.5": "Спокойные (запредельные) эти пребывания в благородного выведении называются.",
  "mn8:9.1": "Возможность то ведь такая, Чунда, существует когда некий монах всецело пространства-бескрайнего-область превзойдя 'бескрайнее внимание' внимания-бескрайнего-область достигнув пребывал бы.",
  "mn8:9.2": "Ему так явилось бы:",
  "mn8:9.3": "‘в стирании пребываю’.",
  "mn8:9.4": "Но не эти ведь, Чунда, в благородного выведении 'стирания' называются.",
  "mn8:9.5": "Спокойные эти пребывания в благородного выведении называются.",
  "mn8:10.1": "Возможность то ведь такая, Чунда, существует когда некий монах всецело внимания-бескрайнего-область превзойдя 'нет чего-либо' без-чего-либо-область достигнув пребывал бы.",
  "mn8:10.2": "Ему так явилось бы:",
  "mn8:10.3": "‘в стирании пребываю’.",
  "mn8:10.4": "Но не эти ведь, Чунда, в благородного выведении 'стирания' называются.",
  "mn8:10.5": "Спокойные эти пребывания в благородного выведении называются.",
  "mn8:11.1": "Возможность то ведь такая, Чунда, существует когда некий монах всецело без-чего-либо-область превзойдя и-не-сознавания-не-бессознательности-область достигнув пребывал бы.",
  "mn8:11.2": "Ему так явилось бы:",
  "mn8:11.3": "‘в стирании пребываю’.",
  "mn8:11.4": "Но не эти ведь, Чунда, в благородного выведении 'стирания' называются.",
  "mn8:11.5": "Спокойные эти пребывания в благородного выведении называются.",
  "mn8:12.0": "Стирания-объяснение",
  "mn8:12.1": "И вот вам, Чунда, стирание должное (которое должно быть предпринято).",
  "mn8:12.2": "'Другие вредящие будут, мы здесь (в этой плане) не-вредящие будем' стирание должное.",
  "mn8:12.3": "'Другие жизнь уменьшающие будут, мы здесь от жизнь уменьшения отвратившиеся (не-ратующие) будем' стирание должное.",
  "mn8:12.4": "'Другие не-данное-берущие будут, мы здесь от не-данного-взятия отвратившиеся будем' стирание должное.",
  "mn8:12.5": "'Другие не-целомудренные будут, мы здесь целомудренные будем' стирание должное.",
  "mn8:12.6": "'Другие ложно-утверждающие будут, мы здесь от ложно-утверждения отвратившиеся ()будем' стирание должное.",
  "mn8:12.7": "'Другие розняще-высказывающиеся будут, мы здесь от рознящей речи отвратившиеся будем' стирание должное.",
  "mn8:12.8": "'Другие жестко-высказывающиеся будут, мы здесь от жесткой речи отвратившиеся будем' стирание должное.",
  "mn8:12.9": "'Другие пустословящие будут, мы здесь от пустословия отвратившиеся будем' стирание должное.",
  "mn8:12.10": "'Другие алчные будут, мы здесь неалчные будем' стирание должное.",
  "mn8:12.11": "'Другие с-враждебным-умом будут, мы здесь с-без-враждебным-умом будем' стирание должное.",
  "mn8:12.12": "'Другие с-ошибочным-взглядом будут, мы здесь с-правильным-взглядом будем' стирание должное.",
  "mn8:12.13": "'Другие с-ошибочным-намерением-привычкой будут, мы здесь с-правильным-намерением-привычкой будем' стирание должное.",
  "mn8:12.14": "'Другие с-ошибочной-речью будут, мы здесь с-правильной-речью будем' стирание должное.",
  "mn8:12.15": "'Другие ошибочно-поступающие будут, мы здесь правильно-поступающие будем' стирание должное.",
  "mn8:12.16": "'Другие с-ошибочным-бытом будут, мы здесь с-правильным-бытом будем' стирание должное.",
  "mn8:12.17": "'Другие ошибочно-старающиеся будут, мы здесь правильно-старающиеся будем' стирание должное.",
  "mn8:12.18": "'Другие ошибочно-памятующие будут, мы здесь правильно-памятующие будем' стирание должное.",
  "mn8:12.19": "'Другие с-ошибочным-объединением-опыта будут, мы здесь с-правильным-объединением-опыта будем' стирание должное.",
  "mn8:12.20": "'Другие ошибочно-знающие будут, мы здесь правильно-знающие будем' стирание должное.",
  "mn8:12.21": "'Другие ошибочно-высвободившиеся будут, мы здесь правильно-высвободившиеся будем' стирание должное.",
  "mn8:12.22": "'Другие с-апатией-сонливостью-связанные будут, мы здесь разошедшиеся-с-апатией-сонливостью будем' стирание должное.",
  "mn8:12.23": "'Другие возбуждённые-взволнованные будут, мы здесь не возбуждённые будем' стирание должное.",
  "mn8:12.24": "'Другие разбредающиеся будут, мы здесь пресекшие-разбредание будем' стирание должное.",
  "mn8:12.25": "'Другие ворчливые будут, мы здесь не-ворчливые будем' стирание должное.",
  "mn8:12.26": "'Другие злопамятные будут, мы здесь без-злопамятности будем' стирание должное.",
  "mn8:12.27": "'Другие умаляющими (принижать) будут, мы здесь без-умаления будем' стирание должное.",
  "mn8:12.28": "'Другие соперничающие (завистливо) будут, мы здесь без-соперничества будем' стирание должное.",
  "mn8:12.29": "'Другие завистливые будут, мы здесь без-зависти будем' стирание должное.",
  "mn8:12.30": "'Другие скупые будут, мы здесь без-скупости будем' стирание должное.",
  "mn8:12.31": "'Другие хитрые (изворотливые) будут, мы здесь без-хитрости будем' стирание должное.",
  "mn8:12.32": "'Другие манипулирющие будут, мы здесь не-манипулирющие будем' стирание должное.",
  "mn8:12.33": "'Другие ригидные будут, мы здесь не-ригидные будем' стирание должное.",
  "mn8:12.34": "'Другие высокомерные будут, мы здесь без-высокомерия будем' стирание должное.",
  "mn8:12.35": "'Другие трудно-наставлиемые будут, мы здесь легко-наставляемые будем' стирание должное.",
  "mn8:12.36": "'Другие с плохими друзьями будут, мы здесь с-благими-друзьями будем' стирание должное.",
  "mn8:12.37": "'Другие беспечные-'опьяненные' будут, мы здесь не-беспечными будем' стирание должное.",
  "mn8:12.38": "'Другие без-верные будут, мы здесь с-верой будем' стирание должное.",
  "mn8:12.39": "'Другие бесстыдные будут, мы здесь стыдливые будем' стирание должное.",
  "mn8:12.40": "'Другие бессовестные будут, мы здесь совестливые будем' стирание должное.",
  "mn8:12.41": "'Другие необученные (не-наслушанные) будут, мы здесь много-изучившие будем' стирание должное.",
  "mn8:12.42": "'Другие ленивые будут, мы здесь решительно-старающиеся будем' стирание должное.",
  "mn8:12.43": "'Другие с-замутнённо-памятующие будут, мы здесь стабильно (установленно)-памятующие будем' стирание должное.",
  "mn8:12.44": "'Другие плохо-понимающие будут, мы здесь пониманием-наделённые будем' стирание должное.",
  "mn8:12.45": "'Другие увиденным-одержимые сосуд-схватившие плохо-отдаляющиеся будут, мы здесь увиденным-не-одержимые сосуд-не-схватившие легко-отдаляющимеся будем' стирание должное.",
  "mn8:13.0": "2. Cittupapādapariyāya",
  "mn8:13.1": "Ума-состояния-восхождение я, Чунда, к благотворным явлениям большое-содействие называю, что тогда сказать с телом, с речью примененные.",
  "mn8:13.2": "Поэтому, Чунда, 'другие вредящие будут, мы здесь не-вредящие будем' ум должен быть поднят.",
  "mn8:13.3": "'Другие жизнь уменьшающие будут, мы здесь от жизнь уменьшения отвратившиеся (не-ратующие) будем' ум должен быть поднят...",
  "mn8:13.4": "'другие увиденным-одержимые сосуд-схватившие плохо-отдаляющиеся будут, мы здесь увиденным-не-одержимые сосуд-не-схватившие легко-отдаляющимеся будем' ум должен быть поднят.",
  "mn8:14.0": "",
  "mn8:14.1": "",
  "mn8:14.2": "",
  "mn8:14.3": "",
  "mn8:14.4": "",
  "mn8:14.5": "",
  "mn8:15.0": "",
  "mn8:15.1": "",
  "mn8:15.2": "",
  "mn8:15.3": "",
  "mn8:16.0": "",
  "mn8:16.1": "",
  "mn8:16.2": "",
  "mn8:16.3": "",
  "mn8:16.4": "",
  "mn8:16.5": "",
  "mn8:16.6": "",
  "mn8:16.7": "",
  "mn8:16.8": "",
  "mn8:16.9": "",
  "mn8:16.10": "",
  "mn8:16.11": "",
  "mn8:16.12": "",
  "mn8:16.13": "",
  "mn8:16.14": "",
  "mn8:16.15": "",
  "mn8:16.16": "",
  "mn8:16.17": "",
  "mn8:16.18": "",
  "mn8:16.19": "",
  "mn8:16.20": "",
  "mn8:16.21": "",
  "mn8:16.22": "",
  "mn8:16.23": "",
  "mn8:16.24": "",
  "mn8:16.25": "",
  "mn8:16.26": "",
  "mn8:16.27": "",
  "mn8:16.28": "",
  "mn8:16.29": "",
  "mn8:16.30": "",
  "mn8:16.31": "",
  "mn8:16.32": "",
  "mn8:16.33": "",
  "mn8:16.34": "",
  "mn8:16.35": "",
  "mn8:16.36": "",
  "mn8:16.37": "",
  "mn8:16.38": "",
  "mn8:16.39": "",
  "mn8:16.40": "",
  "mn8:16.41": "",
  "mn8:16.42": "",
  "mn8:16.43": "",
  "mn8:16.44": "",
  "mn8:16.45": "",
  "mn8:16.46": "",
  "mn8:16.47": "",
  "mn8:17.1": "",
  "mn8:17.2": "",
  "mn8:17.3": "",
  "mn8:17.4": "",
  "mn8:17.5": "",
  "mn8:17.6": "",
  "mn8:17.7": "",
  "mn8:17.8": "",
  "mn8:17.9": "",
  "mn8:17.10": ""
}