{
  "sn35.238:0.1": "Связанные Наставления 35.238",
  "sn35.238:0.2": "Глава Асивиса",
  "sn35.238:0.3": "Сутта Подобно Гадюкам",
  "sn35.238:1.1": "“Це (это) как, монахи, четыре гадюки сильно-вспыльчивые ужасно-ядовитые.",
  "sn35.238:1.2": "Тогда человек проходил бы жить-желающий не-умирать-желающий приятного-желающий от-боли-отстраняющийся.",
  "sn35.238:1.3": "И так бы сказали:",
  "sn35.238:1.4": "'Эти те, дорогой человек, четыре гадюки сильно-вспыльчивые ужасно-ядовитые, своевременно (временем время) должны быть подняты, своевременно должны быть вымыты, своевременно должны быть накормлены, своевременно уложены.",
  "sn35.238:1.5": "А когда на тебя, дорогой человек, из тех четырёх галюк сильно-вспыльчивых ужасно-ядовитых та ли другая ли разозлится, тогда ты, дорогой человек, смерть (умирание) проходишь или с-умиранием-сопоставимую боль.",
  "sn35.238:1.6": "Которое тобой, уважаемый человек, должно быть сделано то делай'.",
  "sn35.238:2.1": "И тогда тот, монахи, человек испугавшийся четырёх гадюк сильно-вспыльчивых ужасно-ядовитых туда или сюда побежал бы.",
  "sn35.238:2.2": "И так бы сказали:",
  "sn35.238:2.3": "'А эти, дорогой человек, пять убийц противников за спиной (за спиной) привязавшихся: 'когда его увидим, тогда жизни лишим''.",
  "sn35.238:2.4": "Которое тобой, уважаемый человек, должно быть сделано то делай'.",
  "sn35.238:3.1": "И тогда тот, монахи, человек испугавшийся четырёх гадюк сильно-вспыльчивых ужасно-ядовитых, испугавшийся пяти убийц противников туда или сюда побежал бы.",
  "sn35.238:3.2": "И так бы сказали:",
  "sn35.238:3.3": "'Это тебе, дорогой человек, шестой внутри-следующий (внедренный, внутренний, как \"шпион-диверсант\") убийца обнаживший оружие (с поднятым мечом) за спиной (за спиной) привязавшийся: 'когда его увижу, тогда голову снесу''.",
  "sn35.238:3.4": "Которое тобой, уважаемый человек, должно быть сделано то делай'.",
  "sn35.238:4.1": "И тогда тот, монахи, человек испугавшийся четырёх гадюк сильно-вспыльчивых ужасно-ядовитых, испугавшийся пяти убийц противников, испугавшийся шестого внутри-следующего убийцы туда или сюда побежал бы.",
  "sn35.238:4.2": "Он увидел бы пустую деревню.",
  "sn35.238:4.3": "И любой дом, который посетил бы опустошенный посетил бы, опорожненный посетил бы, пустой посетил бы.",
  "sn35.238:4.4": "И любая посуда к которой прикоснулся бы к опустошенной прикоснулся бы, к опорожненной прикоснулся бы, к пустой прикоснулся бы.",
  "sn35.238:4.5": "И так бы сказали:",
  "sn35.238:4.6": "‘Сейчас эти, дорогой человек, эту пустую деревню преступники мародеры (деревне-разрушители) посетят.",
  "sn35.238:4.7": "Которое тобой, уважаемый человек, должно быть сделано то делай'.",
  "sn35.238:5.1": "И тогда тот, монахи, человек испугавшийся четырёх гадюк сильно-вспыльчивых ужасно-ядовитых, испугавшийся пяти убийц противников, испугавшийся шестого внутри-следующего убийцы, испугавшийся преступников-мародеров туда или сюда побежал бы.",
  "sn35.238:5.2": "Он увидел бы большую протяжённость воды ближний берег рискованны, опасный, другой берег защищённый, безопасный.",
  "sn35.238:5.3": "Но не было бы судна переправляющего или высяшегося-моста с этого (недругого) на другой для перехода.",
  "sn35.238:5.4": "И тогда, монахи, этому человеку так (пришло) бы:",
  "sn35.238:5.5": "'Вот это большая протяжённость воды ближний берег рискованны, опасный, другой берег защищённый, безопасный, Но нет судна переправляющего или высяшегося-моста с этого на другой для перехода.",
  "sn35.238:5.6": "'Что если я, которую траву-древесину-ветви-листья стаскав (стащив) плот связав на тот плот полагаясь руками и ногами старающийся благополучно на другой пришел бы'.",
  "sn35.238:6.1": "И тогда тот, монахи, человек траву-древесину-ветви-листья стаскав плот связав на тот плот полагаясь руками и ногами старающийся благополучно на другой пришел бы, пересекший, другого-достигший, на суше стоит брахман.",
  "sn35.238:7.1": "А подобие мной это, монахи, сказано для значения более внимательного.",
  "sn35.238:7.2": "И здесь смысл это—",
  "sn35.238:7.3": "А смысл здесь таков:",
  "sn35.238:7.4": "“Четыре гадюки с неистовой злобой и смертельным ядом” – это обозначение четырёх великих стихий—",
  "sn35.238:8.1": "элемента земли, элемента воды, элемента огня, элемента воздуха.",
  "sn35.238:8.2": "“Пять кровожадных врагов” – это обозначение пяти блоков удерживания, в частности—",
  "sn35.238:9.1": "материя-вид блок удерживания, чувствование блок удерживания, сознавание блок удерживания, сложения блок удерживания, внимание-распознавание блок удерживания.",
  "sn35.238:10.1": "“Шестой убийца – близкий товарищ с мечом наизготове” – это обозначение наслаждения и страсти.",
  "sn35.238:10.2": "“Пустая деревня” – это обозначение шести внутренних областей.",
  "sn35.238:10.3": "Если, монахи, мудрый, сведущий, разумный человек изучал бы их посредством глаза, то они представились бы ему не имеющими содержимого, пустыми, полыми.",
  "sn35.238:10.4": "языка…",
  "sn35.238:11.1": "ума-представления, то они представились бы ему не имеющими содержимого, пустыми, полыми.",
  "sn35.238:11.2": "“Преступники” – это обозначение шести внешних сфер чувств.",
  "sn35.238:11.3": "Глаз, монахи, подвергается атаке приятными и неприятными формами.",
  "sn35.238:11.4": "Ухо подвергается атаке приятными и неприятными звуками.",
  "sn35.238:11.5": "Нос подвергается атаке приятными и неприятными запахами.",
  "sn35.238:11.6": "Язык подвергается атаке приятными и неприятными вкусами.",
  "sn35.238:11.7": "Тело подвергается атаке приятными и неприятными тактильными ощущениями.",
  "sn35.238:12.1": "Ум подвергается атаке приятными и неприятными ментальными феноменами.",
  "sn35.238:12.2": "“Обширный участок воды” – это обозначение четырёх наводнений:",
  "sn35.238:13.1": "наводнения желания, наводнения существования, наводнения взгляда, наводнения незнания.",
  "sn35.238:14.1": "“Ближний берег – опасный и вселяющий страх” – это обозначение личности.",
  "sn35.238:15.1": "“Дальний берег – спасительный и безопасный” – это обозначение ниббаны.",
  "sn35.238:15.2": "“Плот” – это обозначение Благородного Восьмеричного Пути, то есть",
  "sn35.238:16.1": "правильного взгляда… правильной трансценденции.",
  "sn35.238:17.1": "“Старание руками и ногами” – это обозначение зарождения усердия.",
  "sn35.238:17.2": "Первая."
}