{
  "dn16:0.1": "Long Discourses 16 ",
  "dn16:0.2": "The Great Discourse on the Buddha’s Extinguishment ",
  "dn16:1.1.1": "So I have heard. ",
  "dn16:1.1.2": "At one time the Buddha was staying near Rājagaha, on the Vulture’s Peak Mountain. ",
  "dn16:1.1.3": "Now at that time King Ajātasattu of Magadha, son of the princess of Videha, wanted to invade the Vajjis. ",
  "dn16:1.1.4": "He declared: ",
  "dn16:1.1.5": "“I shall wipe out these Vajjis, so mighty and powerful! I shall destroy them, and lay ruin and devastation upon them!” ",
  "dn16:1.2.1": "And then King Ajātasattu addressed Vassakāra the brahmin minister of Magadha, ",
  "dn16:1.2.2": "“Please, brahmin, go to the Buddha, and in my name bow with your head to his feet. Ask him if he is healthy and well, nimble, strong, and living comfortably. ",
  "dn16:1.2.4": "And then say: ",
  "dn16:1.2.5": "‘Sir, King Ajātasattu of Magadha, son of the princess of Videha, wants to invade the Vajjis. ",
  "dn16:1.2.6": "He says, ",
  "dn16:1.2.7": "“I shall wipe out these Vajjis, so mighty and powerful! I shall destroy them, and lay ruin and devastation upon them!”’ ",
  "dn16:1.2.8": "Remember well how the Buddha answers and tell it to me. ",
  "dn16:1.2.9": "For Realized Ones say nothing that is not so.” ",
  "dn16:1.3.0": "1. The Brahmin Vassakāra ",
  "dn16:1.3.1": "“Yes, worthy sir,” Vassakāra replied. He had the finest carriages harnessed. Then he mounted a fine carriage and, along with other fine carriages, set out from Rājagaha for the Vulture’s Peak Mountain. ",
  "dn16:1.3.2": "He went by carriage as far as the terrain allowed, then descended and approached the Buddha on foot, and exchanged greetings with him. ",
  "dn16:1.3.3": "When the greetings and polite conversation were over, he sat down to one side and said to the Buddha, ",
  "dn16:1.3.4": "“Worthy Gotama, King Ajātasattu of Magadha, son of the princess of Videha, bows with his head to your feet. He asks if you are healthy and well, nimble, strong, and living comfortably. ",
  "dn16:1.3.5": "Worthy Gotama, King Ajātasattu wants to invade the Vajjis. ",
  "dn16:1.3.6": "He has declared: ",
  "dn16:1.3.7": "‘I shall wipe out these Vajjis, so mighty and powerful! I shall destroy them, and lay ruin and devastation upon them!’” ",
  "dn16:1.4.0": "2. Principles That Prevent Decline ",
  "dn16:1.4.1": "Now at that time Venerable Ānanda was standing behind the Buddha fanning him. ",
  "dn16:1.4.2": "Then the Buddha said to him, ",
  "dn16:1.4.3": "“Ānanda, have you heard that the Vajjis meet frequently and have many meetings?” ",
  "dn16:1.4.4": "“I have heard that, sir.” ",
  "dn16:1.4.5": "“As long as the Vajjis meet frequently and have many meetings, they can expect growth, not decline. ",
  "dn16:1.4.6": "Ānanda, have you heard that the Vajjis meet in harmony, leave in harmony, and carry on their business in harmony?” ",
  "dn16:1.4.7": "“I have heard that, sir.” ",
  "dn16:1.4.8": "“As long as the Vajjis meet in harmony, leave in harmony, and carry on their business in harmony, they can expect growth, not decline. ",
  "dn16:1.4.9": "Ānanda, have you heard that the Vajjis don’t make new decrees or abolish existing decrees, but proceed having undertaken the ancient Vajjian traditions as they have been decreed?” ",
  "dn16:1.4.10": "“I have heard that, sir.” ",
  "dn16:1.4.11": "“As long as the Vajjis don’t make new decrees or abolish existing decrees, but proceed having undertaken the ancient Vajjian traditions as they have been decreed, they can expect growth, not decline. ",
  "dn16:1.4.12": "Ānanda, have you heard that the Vajjis honor, respect, esteem, and venerate Vajjian elders, and think them worth listening to?” ",
  "dn16:1.4.13": "“I have heard that, sir.” ",
  "dn16:1.4.14": "“As long as the Vajjis honor, respect, esteem, and venerate Vajjian elders, and think them worth listening to, they can expect growth, not decline. ",
  "dn16:1.4.15": "Ānanda, have you heard that the Vajjis don’t forcibly abduct the women or girls of the clans and make them live with them?” ",
  "dn16:1.4.16": "“I have heard that, sir.” ",
  "dn16:1.4.17": "“As long as the Vajjis don’t forcibly abduct the women or girls of the clans and make them live with them, they can expect growth, not decline. ",
  "dn16:1.4.18": "Ānanda, have you heard that the Vajjis honor, respect, esteem, and venerate the Vajjian shrines, whether inner or outer, not neglecting the proper spirit-offerings that were given and made in the past?” ",
  "dn16:1.4.19": "“I have heard that, sir.” ",
  "dn16:1.4.20": "“As long as the Vajjis honor, respect, esteem, and venerate the Vajjian shrines, whether inner or outer, not neglecting the proper spirit-offerings that were given and made in the past, they can expect growth, not decline. ",
  "dn16:1.4.21": "Ānanda, have you heard that the Vajjis organize proper protection, shelter, and security for perfected ones, so that more perfected ones might come to the realm and those already here may live in comfort?” ",
  "dn16:1.4.22": "“I have heard that, sir.” ",
  "dn16:1.4.23": "“As long as the Vajjis organize proper protection, shelter, and security for perfected ones, so that more perfected ones might come to the realm and those already here may live in comfort, they can expect growth, not decline.” ",
  "dn16:1.5.1": "Then the Buddha said to Vassakāra, ",
  "dn16:1.5.2": "“Brahmin, this one time I was staying near Vesālī at the Sārandada Tree-shrine. ",
  "dn16:1.5.3": "There I taught the Vajjis these seven principles that prevent decline. ",
  "dn16:1.5.4": "As long as these seven principles that prevent decline last among the Vajjis, and as long as the Vajjis are seen following them, they can expect growth, not decline.” ",
  "dn16:1.5.5": "When the Buddha had spoken, Vassakāra said to him, ",
  "dn16:1.5.6": "“Worthy Gotama, if the Vajjis follow even a single one of these principles they can expect growth, not decline. ",
  "dn16:1.5.7": "How much more so all seven! ",
  "dn16:1.5.8": "King Ajātasattu cannot defeat the Vajjis in war, unless by bribery or by sowing dissension. ",
  "dn16:1.5.9": "Well, now, worthy Gotama, I must go. I have many duties, and much to do.” ",
  "dn16:1.5.10": "“Please, brahmin, go at your convenience.” ",
  "dn16:1.5.11": "Then Vassakāra the brahmin, having approved and agreed with what the Buddha said, got up from his seat and left. ",
  "dn16:1.6.0": "3. Principles That Prevent Decline Among the Mendicants ",
  "dn16:1.6.1": "Soon after he had left, the Buddha said to Ānanda, ",
  "dn16:1.6.2": "“Go, Ānanda, gather all the mendicants staying in the vicinity of Rājagaha together in the assembly hall.” ",
  "dn16:1.6.3": "“Yes, sir,” replied Ānanda. He did what the Buddha asked. Then he went back, bowed, stood to one side, and said to him, ",
  "dn16:1.6.4": "“Sir, the mendicant Saṅgha has assembled. Please, sir, go at your convenience.” ",
  "dn16:1.6.5": "Then the Buddha went to the assembly hall, where he sat on the seat spread out ",
  "dn16:1.6.6": "and addressed the mendicants: ",
  "dn16:1.6.7": "“Mendicants, I will teach you these seven principles that prevent decline. ",
  "dn16:1.6.8": "Listen and apply your mind well, I will speak.” ",
  "dn16:1.6.9": "“Yes, sir,” they replied. ",
  "dn16:1.6.10": "The Buddha said this: ",
  "dn16:1.6.11": "“As long as the mendicants meet frequently and have many meetings, they can expect growth, not decline. ",
  "dn16:1.6.12": "As long as the mendicants meet in harmony, leave in harmony, and carry on their business in harmony, they can expect growth, not decline. ",
  "dn16:1.6.13": "As long as the mendicants don’t make new decrees or abolish existing decrees, but undertake and follow the training rules as they have been decreed, they can expect growth, not decline. ",
  "dn16:1.6.14": "As long as the mendicants honor, respect, esteem, and venerate the senior mendicants—of long standing, long gone forth, fathers and leaders of the Saṅgha—and think them worth listening to, they can expect growth, not decline. ",
  "dn16:1.6.15": "As long as the mendicants don’t fall under the sway of arisen craving for future lives, they can expect growth, not decline. ",
  "dn16:1.6.16": "As long as the mendicants take care to live in wilderness lodgings, they can expect growth, not decline. ",
  "dn16:1.6.17": "As long as the mendicants individually establish mindfulness, so that more good-hearted spiritual companions might come, and those that have already come may live comfortably, they can expect growth, not decline. ",
  "dn16:1.6.18": "As long as these seven principles that prevent decline last among the mendicants, and as long as the mendicants are seen following them, they can expect growth, not decline. ",
  "dn16:1.7.1": "I will teach you seven more principles that prevent decline. … ",
  "dn16:1.7.4": "As long as the mendicants don’t relish work, loving it and liking to relish it, they can expect growth, not decline. ",
  "dn16:1.7.5": "As long as they don’t relish talk … ",
  "dn16:1.7.6": "sleep … ",
  "dn16:1.7.7": "company … ",
  "dn16:1.7.8": "they don’t have corrupt wishes, falling under the sway of corrupt wishes … ",
  "dn16:1.7.9": "they don’t have bad friends, companions, and associates … ",
  "dn16:1.7.10": "they don’t stop half-way after achieving some insignificant distinction, they can expect growth, not decline. ",
  "dn16:1.8.1": "As long as these seven principles that prevent decline last among the mendicants, and as long as the mendicants are seen following them, they can expect growth, not decline. ",
  "dn16:1.8.2": "I will teach you seven more principles that prevent decline. … ",
  "dn16:1.8.3": "As long as the mendicants are faithful … ",
  "dn16:1.8.4": "conscientious … ",
  "dn16:1.8.5": "prudent … ",
  "dn16:1.8.6": "learned … ",
  "dn16:1.8.7": "energetic … ",
  "dn16:1.8.8": "mindful … ",
  "dn16:1.8.9": "wise, they can expect growth, not decline. ",
  "dn16:1.8.10": "As long as these seven principles that prevent decline last among the mendicants, and as long as the mendicants are seen following them, they can expect growth, not decline. ",
  "dn16:1.8.11": "I will teach you seven more principles that prevent decline. … ",
  "dn16:1.9.1": "As long as the mendicants develop the awakening factors of mindfulness … ",
  "dn16:1.9.2": "investigation of principles … ",
  "dn16:1.9.3": "energy … ",
  "dn16:1.9.4": "rapture … ",
  "dn16:1.9.5": "tranquility … ",
  "dn16:1.9.6": "immersion … ",
  "dn16:1.9.7": "equanimity, they can expect growth, not decline. ",
  "dn16:1.10.1": "As long as these seven principles that prevent decline last among the mendicants, and as long as the mendicants are seen following them, they can expect growth, not decline. ",
  "dn16:1.10.2": "I will teach you seven more principles that prevent decline. … ",
  "dn16:1.10.5": "As long as the mendicants develop the perceptions of impermanence … ",
  "dn16:1.10.6": "not-self … ",
  "dn16:1.10.7": "ugliness … ",
  "dn16:1.10.8": "drawbacks … ",
  "dn16:1.10.9": "giving up … ",
  "dn16:1.10.10": "fading away … ",
  "dn16:1.10.11": "cessation, they can expect growth, not decline. ",
  "dn16:1.10.12": "As long as these seven principles that prevent decline last among the mendicants, and as long as the mendicants are seen following them, they can expect growth, not decline. ",
  "dn16:1.11.1": "I will teach you six principles that prevent decline. … ",
  "dn16:1.11.4": "As long as the mendicants consistently treat their spiritual companions with bodily kindness … ",
  "dn16:1.11.5": "verbal kindness … ",
  "dn16:1.11.6": "and mental kindness both in public and in private, they can expect growth, not decline. ",
  "dn16:1.11.7": "As long as the mendicants share without reservation any material things they have gained by legitimate means, even the food placed in the alms-bowl, using them in common with their ethical spiritual companions, they can expect growth, not decline. ",
  "dn16:1.11.8": "As long as the mendicants live according to the precepts shared with their spiritual companions, both in public and in private—such precepts as are intact, impeccable, spotless, and unmarred, liberating, praised by sensible people, not mistaken, and leading to immersion—they can expect growth, not decline. ",
  "dn16:1.11.9": "As long as the mendicants live according to the view shared with their spiritual companions, both in public and in private—the view that is noble and emancipating, and delivers one who practices it to the complete end of suffering—they can expect growth, not decline. ",
  "dn16:1.11.10": "As long as these six principles that prevent decline last among the mendicants, and as long as the mendicants are seen following them, they can expect growth, not decline.” ",
  "dn16:1.12.1": "And while staying there at the Vulture’s Peak the Buddha often gave this Dhamma talk to the mendicants: ",
  "dn16:1.12.2": "“Such is ethics, such is immersion, such is wisdom. ",
  "dn16:1.12.3": "When immersion is imbued with ethics it’s very fruitful and beneficial. ",
  "dn16:1.12.4": "When wisdom is imbued with immersion it’s very fruitful and beneficial. ",
  "dn16:1.12.5": "When the mind is imbued with wisdom it is rightly freed from the defilements, namely, ",
  "dn16:1.12.6": "the defilements of sensuality, desire to be reborn, and ignorance.” ",
  "dn16:1.13.1": "When the Buddha had stayed in Rājagaha as long as he pleased, he addressed Venerable Ānanda, ",
  "dn16:1.13.2": "“Come, Ānanda, let’s go to Ambalaṭṭhikā.” ",
  "dn16:1.13.3": "“Yes, sir,” Ānanda replied. ",
  "dn16:1.13.4": "Then the Buddha together with a large Saṅgha of mendicants arrived at Ambalaṭṭhikā, ",
  "dn16:1.14.1": "where he stayed in the royal rest-house. ",
  "dn16:1.14.2": "And while staying there, too, he often gave this Dhamma talk to the mendicants: ",
  "dn16:1.14.3": "“Such is ethics, such is immersion, such is wisdom. ",
  "dn16:1.14.4": "When immersion is imbued with ethics it’s very fruitful and beneficial. ",
  "dn16:1.14.5": "When wisdom is imbued with immersion it’s very fruitful and beneficial. ",
  "dn16:1.14.6": "When the mind is imbued with wisdom it is rightly freed from the defilements, namely, ",
  "dn16:1.14.7": "the defilements of sensuality, desire to be reborn, and ignorance.” ",
  "dn16:1.15.1": "When the Buddha had stayed in Ambalaṭṭhikā as long as he pleased, he addressed Venerable Ānanda, ",
  "dn16:1.15.2": "“Come, Ānanda, let’s go to Nāḷandā.” ",
  "dn16:1.15.3": "“Yes, sir,” Ānanda replied. ",
  "dn16:1.15.4": "Then the Buddha together with a large Saṅgha of mendicants arrived at Nāḷandā, ",
  "dn16:1.15.5": "where he stayed in Pāvārika’s mango grove. ",
  "dn16:1.16.0": "4. Sāriputta’s Lion’s Roar ",
  "dn16:1.16.1": "Then Sāriputta went up to the Buddha, bowed, sat down to one side, and said to him, ",
  "dn16:1.16.2": "“Sir, I have such confidence in the Buddha that ",
  "dn16:1.16.3": "I believe there’s no other ascetic or brahmin—whether past, future, or present—whose direct knowledge is superior to the Buddha when it comes to awakening.” ",
  "dn16:1.16.4": "“That’s a grand and dramatic statement, Sāriputta. You’ve roared a definitive, categorical lion’s roar, saying: ",
  "dn16:1.16.5": "‘I have such confidence in the Buddha that ",
  "dn16:1.16.6": "I believe there’s no other ascetic or brahmin—whether past, future, or present—whose direct knowledge is superior to the Buddha when it comes to awakening.’ ",
  "dn16:1.16.7": "What about all the perfected ones, the fully awakened Buddhas who lived in the past? Have you comprehended their minds to know that ",
  "dn16:1.16.8": "those Buddhas had such ethics, or such qualities, or such wisdom, or such meditation, or such freedom?” ",
  "dn16:1.16.9": "“No, sir.” ",
  "dn16:1.16.10": "“And what about all the perfected ones, the fully awakened Buddhas who will live in the future? Have you comprehended their minds to know that ",
  "dn16:1.16.11": "those Buddhas will have such ethics, or such qualities, or such wisdom, or such meditation, or such freedom?” ",
  "dn16:1.16.12": "“No, sir.” ",
  "dn16:1.16.13": "“And what about me, the perfected one, the fully awakened Buddha at present? Have you comprehended my mind to know that ",
  "dn16:1.16.14": "I have such ethics, or such qualities, or such wisdom, or such meditation, or such freedom?” ",
  "dn16:1.16.15": "“No, sir.” ",
  "dn16:1.16.16": "“Well then, Sāriputta, given that you don’t comprehend the minds of Buddhas past, future, or present, ",
  "dn16:1.16.17": "what exactly are you doing, making such a grand and dramatic statement, roaring such a definitive, categorical lion’s roar?” ",
  "dn16:1.17.1": "“Sir, though I don’t comprehend the minds of Buddhas past, future, and present, ",
  "dn16:1.17.2": "still I understand this by inference from the teaching. ",
  "dn16:1.17.3": "Suppose there was a king’s frontier citadel with fortified embankments, ramparts, and arches, and a single gate. ",
  "dn16:1.17.4": "And it has a gatekeeper who is astute, competent, and intelligent. He keeps strangers out and lets known people in. ",
  "dn16:1.17.5": "As he walks around the patrol path, he doesn’t see a hole or cleft in the wall, not even one big enough for a cat to slip out. ",
  "dn16:1.17.6": "He thinks: ",
  "dn16:1.17.7": "‘Whatever sizable creatures enter or leave the citadel, all of them do so via this gate.’ ",
  "dn16:1.17.8": "In the same way, I understand this by inference from the teaching: ",
  "dn16:1.17.9": "‘All the perfected ones, fully awakened Buddhas—whether past, future, or present—give up the five hindrances, corruptions of the heart that weaken wisdom. Their mind is firmly established in the four kinds of mindfulness meditation. They correctly develop the seven awakening factors. And they wake up to the supreme perfect awakening.’” ",
  "dn16:1.18.1": "And while staying at Nāḷandā, too, the Buddha often gave this Dhamma talk to the mendicants: ",
  "dn16:1.18.2": "“Such is ethics, such is immersion, such is wisdom. ",
  "dn16:1.18.3": "When immersion is imbued with ethics it’s very fruitful and beneficial. ",
  "dn16:1.18.4": "When wisdom is imbued with immersion it’s very fruitful and beneficial. ",
  "dn16:1.18.5": "When the mind is imbued with wisdom it is rightly freed from the defilements, namely, ",
  "dn16:1.18.6": "the defilements of sensuality, desire to be reborn, and ignorance.” ",
  "dn16:1.19.0": "5. The Drawbacks of Unethical Conduct ",
  "dn16:1.19.1": "When the Buddha had stayed in Nāḷandā as long as he pleased, he addressed Venerable Ānanda, ",
  "dn16:1.19.2": "“Come, Ānanda, let’s go to Pāṭali Village.” ",
  "dn16:1.19.3": "“Yes, sir,” Ānanda replied. ",
  "dn16:1.19.4": "Then the Buddha together with a large Saṅgha of mendicants arrived at Pāṭali Village. ",
  "dn16:1.20.1": "The lay followers of Pāṭali Village heard that he had arrived. ",
  "dn16:1.20.2": "So they went to see him, bowed, sat down to one side, and said to him, ",
  "dn16:1.20.3": "“Sir, please consent to come to our guest house.” ",
  "dn16:1.20.4": "The Buddha consented with silence. ",
  "dn16:1.21.1": "Then, knowing that the Buddha had consented, the lay followers of Pāṭali Village got up from their seat, bowed, and respectfully circled the Buddha, keeping him on their right. Then they went to the guest house, where they spread carpets all over, prepared seats, set up a water jar, and placed an oil lamp. Then they went back to the Buddha, bowed, stood to one side, and told him of their preparations, saying: ",
  "dn16:1.21.3": "“Please, sir, come at your convenience.” ",
  "dn16:1.22.1": "In the morning, the Buddha robed up and, taking his bowl and robe, went to the guest house together with the Saṅgha of mendicants. Having washed his feet he entered the guest house and sat against the central column facing east. ",
  "dn16:1.22.2": "The Saṅgha of mendicants also washed their feet, entered the guest house, and sat against the west wall facing east, with the Buddha right in front of them. ",
  "dn16:1.22.3": "The lay followers of Pāṭali Village also washed their feet, entered the guest house, and sat against the east wall facing west, with the Buddha right in front of them. ",
  "dn16:1.23.1": "Then the Buddha addressed them: ",
  "dn16:1.23.2": "“Householders, there are these five drawbacks for an unethical person because of their failure in ethics. ",
  "dn16:1.23.3": "What five? ",
  "dn16:1.23.4": "Firstly, an unethical person loses great wealth on account of negligence. ",
  "dn16:1.23.5": "This is the first drawback for an unethical person because of their failure in ethics. ",
  "dn16:1.23.6": "Furthermore, an unethical person gets a bad reputation. ",
  "dn16:1.23.7": "This is the second drawback. ",
  "dn16:1.23.8": "Furthermore, an unethical person enters any kind of assembly timid and embarrassed, whether it’s an assembly of aristocrats, brahmins, householders, or ascetics. ",
  "dn16:1.23.9": "This is the third drawback. ",
  "dn16:1.23.10": "Furthermore, an unethical person feels lost when they die. ",
  "dn16:1.23.11": "This is the fourth drawback. ",
  "dn16:1.23.12": "Furthermore, an unethical person, when their body breaks up, after death, is reborn in a place of loss, a bad place, the underworld, hell. ",
  "dn16:1.23.13": "This is the fifth drawback. ",
  "dn16:1.23.14": "These are the five drawbacks for an unethical person because of their failure in ethics. ",
  "dn16:1.24.0": "6. The Benefits of Ethical Conduct ",
  "dn16:1.24.1": "There are these five benefits for an ethical person because of their accomplishment in ethics. ",
  "dn16:1.24.2": "What five? ",
  "dn16:1.24.3": "Firstly, an ethical person gains great wealth on account of diligence. ",
  "dn16:1.24.4": "This is the first benefit. ",
  "dn16:1.24.5": "Furthermore, an ethical person gets a good reputation. ",
  "dn16:1.24.6": "This is the second benefit. ",
  "dn16:1.24.7": "Furthermore, an ethical person enters any kind of assembly bold and self-assured, whether it’s an assembly of aristocrats, brahmins, householders, or ascetics. ",
  "dn16:1.24.8": "This is the third benefit. ",
  "dn16:1.24.9": "Furthermore, an ethical person dies not feeling lost. ",
  "dn16:1.24.10": "This is the fourth benefit. ",
  "dn16:1.24.11": "Furthermore, when an ethical person’s body breaks up, after death, they’re reborn in a good place, a heavenly realm. ",
  "dn16:1.24.12": "This is the fifth benefit. ",
  "dn16:1.24.13": "These are the five benefits for an ethical person because of their accomplishment in ethics.” ",
  "dn16:1.25.1": "The Buddha spent much of the night educating, encouraging, firing up, and inspiring the lay followers of Pāṭali Village with a Dhamma talk. Then he dismissed them, ",
  "dn16:1.25.2": "“The night is getting late, householders. Please go at your convenience.” ",
  "dn16:1.25.3": "“Yes, sir,” replied the lay followers of Pāṭali Village. They got up from their seat, bowed, and respectfully circled the Buddha, keeping him on their right, before leaving. ",
  "dn16:1.25.4": "Soon after they left the Buddha entered a private cubicle. ",
  "dn16:1.26.0": "7. Building a Citadel ",
  "dn16:1.26.1": "Now at that time the Magadhan ministers Sunidha and Vassakāra were building a citadel at Pāṭali Village to keep the Vajjis out. ",
  "dn16:1.26.2": "At that time thousands of deities were taking possession of building sites in Pāṭali Village. ",
  "dn16:1.26.3": "Illustrious rulers or royal ministers inclined to build houses at sites possessed by illustrious deities. ",
  "dn16:1.27.1": "Middling rulers or royal ministers inclined to build houses at sites possessed by middling deities. ",
  "dn16:1.27.2": "Lesser rulers or royal ministers inclined to build houses at sites possessed by lesser deities. ",
  "dn16:1.27.3": "With clairvoyance that is purified and superhuman, the Buddha saw those deities taking possession of building sites in Pāṭali Village. ",
  "dn16:1.27.4": "The Buddha rose at the crack of dawn and addressed Ānanda, ",
  "dn16:1.27.5": "“Ānanda, who is building a citadel at Pāṭali Village?” ",
  "dn16:1.27.6": "“Sir, the Magadhan ministers Sunidha and Vassakāra are building a citadel to keep the Vajjis out.” ",
  "dn16:1.28.1": "“It’s as if they were building the citadel in consultation with the gods of the thirty-three. ",
  "dn16:1.28.3": "With clairvoyance that is purified and superhuman, I saw those deities taking possession of building sites. ",
  "dn16:1.28.4": "Illustrious rulers or royal ministers inclined to build houses at sites possessed by illustrious deities. ",
  "dn16:1.28.5": "Middling rulers or royal ministers inclined to build houses at sites possessed by middling deities. ",
  "dn16:1.28.6": "Lesser rulers or royal ministers inclined to build houses at sites possessed by lesser deities. ",
  "dn16:1.28.7": "As far as the civilized region extends, as far as the trading zone extends, this will be the chief city: the Pāṭaliputta trade center. ",
  "dn16:1.28.8": "But Pāṭaliputta will face three threats: ",
  "dn16:1.28.9": "from fire, flood, and dissension.” ",
  "dn16:1.29.1": "Then the Magadhan ministers Sunidha and Vassakāra approached the Buddha, and exchanged greetings with him. ",
  "dn16:1.29.2": "When the greetings and polite conversation were over, they stood to one side and said, ",
  "dn16:1.29.3": "“Would the worthy Gotama together with the mendicant Saṅgha please accept today’s meal from me?” ",
  "dn16:1.29.4": "The Buddha consented with silence. ",
  "dn16:1.30.1": "Then, knowing that the Buddha had consented, they went to their own guest house, where they had delicious fresh and cooked foods prepared. Then they had the Buddha informed of the time, saying, ",
  "dn16:1.30.2": "“It’s time, worthy Gotama, the meal is ready.” ",
  "dn16:1.30.3": "Then the Buddha robed up in the morning and, taking his bowl and robe, went to their guest house together with the mendicant Saṅgha, where he sat on the seat spread out. ",
  "dn16:1.30.4": "Then Sunidha and Vassakāra served and satisfied the mendicant Saṅgha headed by the Buddha with their own hands with delicious fresh and cooked foods. ",
  "dn16:1.30.5": "When the Buddha had eaten and washed his hand and bowl, Sunidha and Vassakāra took a low seat and sat to one side. ",
  "dn16:1.31.1": "The Buddha expressed his appreciation with these verses: ",
  "dn16:1.31.2": "“In the place he makes his dwelling, ",
  "dn16:1.31.3": "having fed the astute ",
  "dn16:1.31.4": "and the virtuous here, ",
  "dn16:1.31.5": "the restrained spiritual practitioners, ",
  "dn16:1.31.6": "he should dedicate an offering ",
  "dn16:1.31.7": "to the deities there. ",
  "dn16:1.31.8": "Venerated, they venerate him; ",
  "dn16:1.31.9": "honored, they honor him. ",
  "dn16:1.31.10": "After that they have sympathy for him, ",
  "dn16:1.31.11": "like a mother for the child at her breast. ",
  "dn16:1.31.12": "A man beloved of the deities ",
  "dn16:1.31.13": "always sees nice things.” ",
  "dn16:1.31.14": "When the Buddha had expressed his appreciation to Sunidha and Vassakāra with these verses, he got up from his seat and left. ",
  "dn16:1.32.1": "Sunidha and Vassakāra followed behind the Buddha, thinking, ",
  "dn16:1.32.2": "“The gate through which the ascetic Gotama departs today shall be named the Gotama Gate. ",
  "dn16:1.32.3": "The ford at which he crosses the Ganges River shall be named the Gotama Ford.” ",
  "dn16:1.32.4": "Then the gate through which the Buddha departed was named the Gotama Gate. ",
  "dn16:1.32.5": "Then the Buddha came to the Ganges River. ",
  "dn16:1.33.1": "Now at that time the Ganges was full to the brim so a crow could drink from it. ",
  "dn16:1.33.2": "Wanting to cross from the near to the far shore, some people were seeking a boat, some a dinghy, while some were tying up a raft. ",
  "dn16:1.33.3": "But, as easily as a strong person would extend or contract their arm, the Buddha, together with the mendicant Saṅgha, vanished from the near shore and landed on the far shore. ",
  "dn16:1.34.1": "He saw all those humans wanting to cross over. ",
  "dn16:1.34.2": "Knowing the meaning of this, on that occasion the Buddha expressed this heartfelt sentiment: ",
  "dn16:1.34.3": "“Those who cross a deluge or stream ",
  "dn16:1.34.4": "have built a bridge and left the marshes behind. ",
  "dn16:1.34.5": "While some people are still tying a raft, ",
  "dn16:1.34.6": "intelligent people have crossed over.” ",
  "dn16:1.34.7": "The first recitation section. ",
  "dn16:2.1.0": "8. Talk on the Noble Truths ",
  "dn16:2.1.1": "Then the Buddha said to Venerable Ānanda, ",
  "dn16:2.1.2": "“Come, Ānanda, let’s go to the village of Koṭi.” ",
  "dn16:2.1.3": "“Yes, sir,” Ānanda replied. ",
  "dn16:2.1.4": "Then the Buddha together with a large Saṅgha of mendicants arrived at the village of Koṭi, ",
  "dn16:2.1.5": "and stayed there. ",
  "dn16:2.2.1": "There he addressed the mendicants: ",
  "dn16:2.2.2": "“Mendicants, due to not understanding and not penetrating four noble truths, both you and I have wandered and transmigrated for such a very long time. ",
  "dn16:2.2.3": "What four? ",
  "dn16:2.2.4": "The noble truths of suffering, ",
  "dn16:2.2.5": "the origin of suffering, ",
  "dn16:2.2.6": "the cessation of suffering, ",
  "dn16:2.2.7": "and the practice that leads to the cessation of suffering. ",
  "dn16:2.2.8": "These noble truths of suffering, origin, cessation, and the path have been understood and comprehended. Craving for continued existence has been cut off; the conduit to rebirth is ended; now there’ll be no more future lives.” ",
  "dn16:2.3.1": "That is what the Buddha said. ",
  "dn16:2.3.2": "Then the Holy One, the Teacher, went on to say: ",
  "dn16:2.3.3": "“Because of not truly seeing ",
  "dn16:2.3.4": "the four noble truths, ",
  "dn16:2.3.5": "we have transmigrated for a long time ",
  "dn16:2.3.6": "from one rebirth to the next. ",
  "dn16:2.3.7": "But now that these truths have been seen, ",
  "dn16:2.3.8": "the conduit to rebirth is eradicated. ",
  "dn16:2.3.9": "The root of suffering is cut off, ",
  "dn16:2.3.10": "now there’ll be no more future lives.” ",
  "dn16:2.4.1": "And while staying at the village of Koṭi, too, the Buddha often gave this Dhamma talk to the mendicants: ",
  "dn16:2.4.2": "“Such is ethics, such is immersion, such is wisdom. ",
  "dn16:2.4.3": "When immersion is imbued with ethics it’s very fruitful and beneficial. ",
  "dn16:2.4.4": "When wisdom is imbued with immersion it’s very fruitful and beneficial. ",
  "dn16:2.4.5": "When the mind is imbued with wisdom it is rightly freed from the defilements, namely, ",
  "dn16:2.4.6": "the defilements of sensuality, desire to be reborn, and ignorance.” ",
  "dn16:2.5.0": "9. The Deaths in Ñātika ",
  "dn16:2.5.1": "When the Buddha had stayed in the village of Koṭi as long as he pleased, he said to Ānanda, ",
  "dn16:2.5.2": "“Come, Ānanda, let’s go to the land of the Ñātikas.” ",
  "dn16:2.5.3": "“Yes, sir,” Ānanda replied. ",
  "dn16:2.5.4": "Then the Buddha together with a large Saṅgha of mendicants arrived in the land of the Ñātikas, ",
  "dn16:2.5.5": "where he stayed in the brick house at Ñātika. ",
  "dn16:2.6.1": "Then Venerable Ānanda went up to the Buddha, bowed, sat down to one side, and said to him, ",
  "dn16:2.6.2": "“Sir, the monk named Sāḷha has passed away in Ñātika. Where has he been reborn in his next life? ",
  "dn16:2.6.3": "The nun named Nandā, ",
  "dn16:2.6.4": "the layman named Sudatta, ",
  "dn16:2.6.5": "and the laywoman named Sujātā have passed away in Ñātika. Where have they been reborn in the next life? ",
  "dn16:2.6.6": "The laymen named Kakkaṭa, ",
  "dn16:2.6.7": "Kaḷibha, ",
  "dn16:2.6.8": "Nikata, ",
  "dn16:2.6.9": "Kaṭissaha, ",
  "dn16:2.6.10": "Tuṭṭha, ",
  "dn16:2.6.11": "Santuṭṭha, ",
  "dn16:2.6.12": "Bhadda, and ",
  "dn16:2.6.13": "Subhadda have passed away in Ñātika. Where have they been reborn in the next life?” ",
  "dn16:2.7.1": "“Ānanda, the monk Sāḷha had realized the undefiled freedom of heart and freedom by wisdom in this very life, having realized it with his own insight due to the ending of defilements. ",
  "dn16:2.7.2": "The nun Nandā had ended the five lower fetters. She’s been reborn spontaneously, and will be extinguished there, not liable to return from that world. ",
  "dn16:2.7.3": "The layman Sudatta had ended three fetters, and weakened greed, hate, and delusion. He’s a once-returner; he will come back to this world once only, then make an end of suffering. ",
  "dn16:2.7.4": "The laywoman Sujātā had ended three fetters. She’s a stream-enterer, not liable to be reborn in the underworld, bound for awakening. ",
  "dn16:2.7.5": "The laymen Kakkaṭa, ",
  "dn16:2.7.6": "Kaḷibha, ",
  "dn16:2.7.7": "Nikata, ",
  "dn16:2.7.8": "Kaṭissaha, ",
  "dn16:2.7.9": "Tuṭṭha, ",
  "dn16:2.7.10": "Santuṭṭha, ",
  "dn16:2.7.11": "Bhadda, ",
  "dn16:2.7.12": "and Subhadda had ended the five lower fetters. They’ve been reborn spontaneously, and will be extinguished there, not liable to return from that world. ",
  "dn16:2.7.13": "Over fifty laymen in Ñātika have passed away having ended the five lower fetters. They’ve been reborn spontaneously, and will be extinguished there, not liable to return from that world. ",
  "dn16:2.7.14": "More than ninety laymen in Ñātika have passed away having ended three fetters, and weakened greed, hate, and delusion. They’re once-returners, who will come back to this world once only, then make an end of suffering. ",
  "dn16:2.7.15": "More than five hundred laymen in Ñātika have passed away having ended three fetters. They’re stream-enterers, not liable to be reborn in the underworld, bound for awakening. ",
  "dn16:2.8.0": "10. The Mirror of the Teaching ",
  "dn16:2.8.1": "It’s no wonder that a human being should pass away. ",
  "dn16:2.8.2": "But if you should come and ask me about it each and every time someone passes away, that would be a bother for me. ",
  "dn16:2.8.3": "So Ānanda, I will teach you the explanation of the Dhamma called ‘the mirror of the teaching’. A noble disciple who has this may declare of themselves: ",
  "dn16:2.8.4": "‘I’ve finished with rebirth in hell, the animal realm, and the ghost realm. I’ve finished with all places of loss, bad places, the underworld. I am a stream-enterer! I’m not liable to be reborn in the underworld, and am bound for awakening.’ ",
  "dn16:2.9.1": "And what is that mirror of the teaching? ",
  "dn16:2.9.3": "It’s when a noble disciple has experiential confidence in the Buddha: ",
  "dn16:2.9.4": "‘That Blessed One is perfected, a fully awakened Buddha, accomplished in knowledge and conduct, holy, knower of the world, supreme guide for those who wish to train, teacher of gods and humans, awakened, blessed.’ ",
  "dn16:2.9.5": "They have experiential confidence in the teaching: ",
  "dn16:2.9.6": "‘The teaching is well explained by the Buddha—apparent in the present life, immediately effective, inviting inspection, relevant, so that sensible people can know it for themselves.’ ",
  "dn16:2.9.7": "They have experiential confidence in the Saṅgha: ",
  "dn16:2.9.8": "‘The Saṅgha of the Buddha’s disciples is practicing the way that’s good, direct, systematic, and proper. It consists of the four pairs, the eight individuals. This is the Saṅgha of the Buddha’s disciples that is worthy of offerings dedicated to the gods, worthy of hospitality, worthy of a religious donation, worthy of greeting with joined palms, and is the supreme field of merit for the world.’ ",
  "dn16:2.9.9": "And a noble disciple’s ethical conduct is loved by the noble ones, unbroken, impeccable, spotless, and unmarred, liberating, praised by sensible people, not mistaken, and leading to immersion. ",
  "dn16:2.9.10": "This is that mirror of the teaching.” ",
  "dn16:2.10.1": "And while staying there in Ñātika the Buddha often gave this Dhamma talk to the mendicants: ",
  "dn16:2.10.2": "“Such is ethics, such is immersion, such is wisdom. ",
  "dn16:2.10.3": "When immersion is imbued with ethics it’s very fruitful and beneficial. ",
  "dn16:2.10.4": "When wisdom is imbued with immersion it’s very fruitful and beneficial. ",
  "dn16:2.10.5": "When the mind is imbued with wisdom it is rightly freed from the defilements, namely, ",
  "dn16:2.10.6": "the defilements of sensuality, desire to be reborn, and ignorance.” ",
  "dn16:2.11.1": "When the Buddha had stayed in Ñātika as long as he pleased, he addressed Venerable Ānanda, ",
  "dn16:2.11.2": "“Come, Ānanda, let’s go to Vesālī.” ",
  "dn16:2.11.3": "“Yes, sir,” Ānanda replied. ",
  "dn16:2.11.4": "Then the Buddha together with a large Saṅgha of mendicants arrived at Vesālī, ",
  "dn16:2.11.5": "where he stayed in Ambapālī’s mango grove. ",
  "dn16:2.12.1": "There the Buddha addressed the mendicants: ",
  "dn16:2.12.2": "“Mendicants, a mendicant should live mindful and aware. ",
  "dn16:2.12.3": "This is my instruction to you. ",
  "dn16:2.12.4": "And how is a mendicant mindful? ",
  "dn16:2.12.5": "It’s when a mendicant meditates by observing an aspect of the body—keen, aware, and mindful, rid of covetousness and displeasure for the world. ",
  "dn16:2.12.6": "They meditate observing an aspect of feelings … ",
  "dn16:2.12.7": "mind … ",
  "dn16:2.12.8": "principles—keen, aware, and mindful, rid of covetousness and displeasure for the world. ",
  "dn16:2.12.9": "That’s how a mendicant is mindful. ",
  "dn16:2.13.1": "And how is a mendicant aware? ",
  "dn16:2.13.2": "It’s when a mendicant acts with situational awareness when going out and coming back; when looking ahead and aside; when bending and extending the limbs; when bearing the outer robe, bowl and robes; when eating, drinking, chewing, and tasting; when urinating and defecating; when walking, standing, sitting, sleeping, waking, speaking, and keeping silent. ",
  "dn16:2.13.3": "That’s how a mendicant is aware. ",
  "dn16:2.13.4": "A mendicant should live mindful and aware. ",
  "dn16:2.13.5": "This is my instruction to you.” ",
  "dn16:2.14.0": "11. Ambapālī the Courtesan ",
  "dn16:2.14.1": "Ambapālī the courtesan heard that the Buddha had arrived and was staying in her mango grove. ",
  "dn16:2.14.2": "She had the finest carriages harnessed. Then she mounted a fine carriage and, along with other fine carriages, set out from Vesālī for her own park. ",
  "dn16:2.14.3": "She went by carriage as far as the terrain allowed, then descended and approached the Buddha on foot. She bowed and sat down to one side. ",
  "dn16:2.14.4": "The Buddha educated, encouraged, fired up, and inspired her with a Dhamma talk. ",
  "dn16:2.14.5": "Then she said to the Buddha, ",
  "dn16:2.14.6": "“Sir, may the Buddha together with the mendicant Saṅgha please accept tomorrow’s meal from me.” ",
  "dn16:2.14.7": "The Buddha consented with silence. ",
  "dn16:2.14.8": "Then, knowing that the Buddha had consented, Ambapālī got up from her seat, bowed, and respectfully circled the Buddha, keeping him on her right, before leaving. ",
  "dn16:2.15.1": "The Licchavis of Vesālī also heard that the Buddha had arrived and was staying in Ambapālī’s mango grove. ",
  "dn16:2.15.2": "They had the finest carriages harnessed. Then they mounted a fine carriage and, along with other fine carriages, set out from Vesālī. ",
  "dn16:2.15.3": "Some of the Licchavis were in blue, of blue color, clad in blue, adorned with blue. And some were similarly colored in yellow, red, or white. ",
  "dn16:2.16.1": "Then Ambapālī the courtesan collided with those Licchavi youths, axle to axle, wheel to wheel, yoke to yoke. ",
  "dn16:2.16.2": "The Licchavis said to her, ",
  "dn16:2.16.3": "“What, you wench Ambapālī, are you doing colliding with us axle to axle, wheel to wheel, yoke to yoke?” ",
  "dn16:2.16.4": "“Well, masters, it’s because I’ve invited the Buddha for tomorrow’s meal together with the mendicant Saṅgha.” ",
  "dn16:2.16.5": "“Wench, give us that meal for a hundred thousand!” ",
  "dn16:2.16.6": "“Masters, even if you were to give me Vesālī with her provinces, I still wouldn’t give that meal to you.” ",
  "dn16:2.16.7": "Then the Licchavis snapped their fingers, saying, ",
  "dn16:2.16.8": "“We’ve been beaten by the aunty! We’ve been beaten by the aunty!” ",
  "dn16:2.16.9": "Then they continued on to Ambapālī’s mango grove. ",
  "dn16:2.17.1": "The Buddha saw them coming off in the distance, ",
  "dn16:2.17.2": "and addressed the mendicants: ",
  "dn16:2.17.3": "“Any of the mendicants who’ve never seen the gods of the thirty-three, just have a look at the assembly of Licchavis. ",
  "dn16:2.17.4": "See the assembly of Licchavis, ",
  "dn16:2.17.5": "check them out: ",
  "dn16:2.17.6": "they’re just like the thirty-three!” ",
  "dn16:2.18.1": "The Licchavis went by carriage as far as the terrain allowed, then descended and approached the Buddha on foot. They bowed to the Buddha, sat down to one side, ",
  "dn16:2.18.2": "and the Buddha educated, encouraged, fired up, and inspired them with a Dhamma talk. ",
  "dn16:2.18.3": "Then they said to the Buddha, ",
  "dn16:2.18.4": "“Sir, may the Buddha together with the mendicant Saṅgha please accept tomorrow’s meal from us.” ",
  "dn16:2.18.5": "Then the Buddha said to the Licchavis, ",
  "dn16:2.18.6": "“I have already accepted tomorrow’s meal from Ambapālī the courtesan.” ",
  "dn16:2.18.7": "Then the Licchavis snapped their fingers, saying, ",
  "dn16:2.18.8": "“We’ve been beaten by the aunty! We’ve been beaten by the aunty!” ",
  "dn16:2.18.9": "And then those Licchavis approved and agreed with what the Buddha said. They got up from their seat, bowed, and respectfully circled the Buddha, keeping him on their right, before leaving. ",
  "dn16:2.19.1": "And when the night had passed Ambapālī had delicious fresh and cooked foods prepared in her own park. Then she had the Buddha informed of the time, saying, ",
  "dn16:2.19.2": "“Sir, it’s time. The meal is ready.” ",
  "dn16:2.19.3": "Then the Buddha robed up in the morning and, taking his bowl and robe, went to the home of Ambapālī together with the mendicant Saṅgha, where he sat on the seat spread out. ",
  "dn16:2.19.4": "Then Ambapālī served and satisfied the mendicant Saṅgha headed by the Buddha with her own hands with delicious fresh and cooked foods. ",
  "dn16:2.19.5": "When the Buddha had eaten and washed his hands and bowl, Ambapālī took a low seat, sat to one side, ",
  "dn16:2.19.6": "and said to the Buddha, ",
  "dn16:2.19.7": "“Sir, I present this park to the mendicant Saṅgha headed by the Buddha.” ",
  "dn16:2.19.8": "The Buddha accepted the park. ",
  "dn16:2.19.9": "Then the Buddha educated, encouraged, fired up, and inspired her with a Dhamma talk, after which he got up from his seat and left. ",
  "dn16:2.20.1": "And while staying at Vesālī, too, the Buddha often gave this Dhamma talk to the mendicants: ",
  "dn16:2.20.2": "“Such is ethics, such is immersion, such is wisdom. ",
  "dn16:2.20.3": "When immersion is imbued with ethics it’s very fruitful and beneficial. ",
  "dn16:2.20.4": "When wisdom is imbued with immersion it’s very fruitful and beneficial. ",
  "dn16:2.20.5": "When the mind is imbued with wisdom it is rightly freed from the defilements, namely, ",
  "dn16:2.20.6": "the defilements of sensuality, desire to be reborn, and ignorance.” ",
  "dn16:2.21.0": "12. Commencing the Rains at Beluva ",
  "dn16:2.21.1": "When the Buddha had stayed in Ambapālī’s mango grove as long as he pleased, he addressed Venerable Ānanda, ",
  "dn16:2.21.2": "“Come, Ānanda, let’s go to the little village of Beluva.” ",
  "dn16:2.21.3": "“Yes, sir,” Ānanda replied. ",
  "dn16:2.21.4": "Then the Buddha together with a large Saṅgha of mendicants arrived at the little village of Beluva, ",
  "dn16:2.21.5": "and stayed there. ",
  "dn16:2.22.1": "There the Buddha addressed the mendicants: ",
  "dn16:2.22.2": "“Mendicants, please enter the rainy season residence with whatever friends or acquaintances you have around Vesālī. ",
  "dn16:2.22.3": "I’ll commence the rainy season residence right here in the little village of Beluva.” ",
  "dn16:2.22.4": "“Yes, sir,” those mendicants replied. They did as the Buddha said, ",
  "dn16:2.22.5": "while the Buddha commenced the rainy season residence right there in the little village of Beluva. ",
  "dn16:2.23.1": "After the Buddha had commenced the rainy season residence, he fell severely ill, struck by dreadful pains, close to death. ",
  "dn16:2.23.2": "But he endured unbothered, with mindfulness and situational awareness. ",
  "dn16:2.23.3": "Then it occurred to the Buddha, ",
  "dn16:2.23.4": "“It would not be appropriate for me to be fully extinguished before informing my supporters and taking leave of the mendicant Saṅgha. ",
  "dn16:2.23.5": "Why don’t I forcefully suppress this illness, stabilize the life force, and live on?” ",
  "dn16:2.24.1": "So that is what he did. ",
  "dn16:2.24.2": "Then the Buddha’s illness died down. ",
  "dn16:2.24.3": "Soon after the Buddha had recovered from that sickness, he came out from his dwelling and sat in the shade of the porch on the seat spread out. ",
  "dn16:2.24.4": "Then Venerable Ānanda went up to the Buddha, bowed, sat down to one side, and said to him, ",
  "dn16:2.24.5": "“Sir, it’s fantastic that the Buddha is comfortable and well. Because when the Buddha was sick, my body felt like it was drugged. I was disorientated, and the teachings weren’t clear to me. ",
  "dn16:2.24.6": "Still, at least I was consoled by the thought that ",
  "dn16:2.24.7": "the Buddha won’t be fully extinguished without bringing something up regarding the Saṅgha of mendicants.” ",
  "dn16:2.25.1": "“But what could the mendicant Saṅgha expect from me, Ānanda? ",
  "dn16:2.25.2": "I’ve taught the Dhamma without making any distinction between secret and public teachings. ",
  "dn16:2.25.3": "The Realized One doesn’t have the closed fist of a tutor when it comes to the teachings. ",
  "dn16:2.25.4": "If there’s anyone who thinks: ",
  "dn16:2.25.5": "‘I shall lead the mendicant Saṅgha,’ or ‘the Saṅgha of mendicants is meant for me,’ let them bring something up regarding the Saṅgha. ",
  "dn16:2.25.6": "But the Realized One doesn’t think like this, ",
  "dn16:2.25.8": "so why should he bring something up regarding the Saṅgha? ",
  "dn16:2.25.9": "I’m now old, elderly and senior. I’m advanced in years and have reached the final stage of life. ",
  "dn16:2.25.10": "I’m currently eighty years old. ",
  "dn16:2.25.11": "Just as a decrepit old cart is kept going by a rope, ",
  "dn16:2.25.12": "in the same way, the Realized One’s body is kept going as if by a rope. ",
  "dn16:2.25.13": "Sometimes the Realized One, not focusing on any signs, and with the cessation of certain feelings, enters and remains in the signless immersion of the heart. Only then does the Realized One’s body become more comfortable. ",
  "dn16:2.26.1": "So Ānanda, live as your own island, your own refuge, with no other refuge. Let the teaching be your island and your refuge, with no other refuge. ",
  "dn16:2.26.2": "And how does a mendicant do this? ",
  "dn16:2.26.3": "It’s when a mendicant meditates by observing an aspect of the body—keen, aware, and mindful, rid of covetousness and displeasure for the world. ",
  "dn16:2.26.4": "They meditate observing an aspect of feelings … ",
  "dn16:2.26.5": "mind … ",
  "dn16:2.26.6": "principles—keen, aware, and mindful, rid of covetousness and displeasure for the world. ",
  "dn16:2.26.7": "That’s how a mendicant is their own island, their own refuge, with no other refuge. That’s how the teaching is their island and their refuge, with no other refuge. ",
  "dn16:2.26.8": "Whether now or after I have passed, any who shall live as their own island, their own refuge, with no other refuge; with the teaching as their island and their refuge, with no other refuge—those mendicants of mine who want to train shall be among the best of the best.” ",
  "dn16:2.26.9": "The second recitation section. ",
  "dn16:3.1.0": "13. An Obvious Hint ",
  "dn16:3.1.1": "Then the Buddha robed up in the morning and, taking his bowl and robe, entered Vesālī for alms. ",
  "dn16:3.1.2": "Then, after the meal, on his return from almsround, he addressed Venerable Ānanda: ",
  "dn16:3.1.3": "“Ānanda, get your sitting cloth. ",
  "dn16:3.1.4": "Let’s go to the Cāpāla Shrine for the day’s meditation.” ",
  "dn16:3.1.5": "“Yes, sir,” replied Ānanda. Taking his sitting cloth he followed behind the Buddha. ",
  "dn16:3.2.1": "Then the Buddha went up to the Cāpāla Shrine, where he sat on the seat spread out. ",
  "dn16:3.2.2": "Ānanda bowed to the Buddha and sat down to one side. ",
  "dn16:3.2.3": "The Buddha said to him: ",
  "dn16:3.2.4": "“Ānanda, Vesālī is lovely. And the Udena, Gotamaka, Seven Maidens, Many Sons, Sārandada, and Cāpāla Tree-shrines are all lovely. ",
  "dn16:3.3.1": "Whoever has developed and cultivated the four bases of psychic power—made them a vehicle and a basis, kept them up, consolidated them, and properly implemented them—may, if they wish, live for the proper lifespan or what’s left of it. ",
  "dn16:3.3.2": "The Realized One has developed and cultivated the four bases of psychic power, made them a vehicle and a basis, kept them up, consolidated them, and properly implemented them. If he wished, the Realized One could live for the proper lifespan or what’s left of it.” ",
  "dn16:3.4.1": "But Ānanda didn’t get it, even though the Buddha dropped such an obvious hint, such a clear sign. ",
  "dn16:3.4.2": "He didn’t beg the Buddha: ",
  "dn16:3.4.3": "“Sir, may the Blessed One please remain for the proper lifespan! May the Holy One please remain for the proper lifespan! That would be for the welfare and happiness of the people, out of sympathy for the world, for the benefit, welfare, and happiness of gods and humans.” For his mind was as if possessed by Māra. ",
  "dn16:3.5.1": "For a second time … ",
  "dn16:3.5.2": "And for a third time, the Buddha said to Ānanda: ",
  "dn16:3.5.3": "“Ānanda, Vesālī is lovely. And the Udena, Gotamaka, Seven Maidens, Many Sons, Sārandada, and Cāpāla Tree-shrines are all lovely. ",
  "dn16:3.5.4": "Whoever has developed and cultivated the four bases of psychic power—made them a vehicle and a basis, kept them up, consolidated them, and properly implemented them—may, if they wish, live for the proper lifespan or what’s left of it. ",
  "dn16:3.5.5": "The Realized One has developed and cultivated the four bases of psychic power, made them a vehicle and a basis, kept them up, consolidated them, and properly implemented them. If he wished, the Realized One could live for the proper lifespan or what’s left of it.” ",
  "dn16:3.5.6": "But Ānanda didn’t get it, even though the Buddha dropped such an obvious hint, such a clear sign. ",
  "dn16:3.5.7": "He didn’t beg the Buddha: ",
  "dn16:3.5.8": "“Sir, may the Blessed One please remain for the proper lifespan! May the Holy One please remain for the proper lifespan! That would be for the welfare and happiness of the people, out of sympathy for the world, for the benefit, welfare, and happiness of gods and humans.” For his mind was as if possessed by Māra. ",
  "dn16:3.6.1": "Then the Buddha got up and said to Venerable Ānanda, ",
  "dn16:3.6.2": "“Go now, Ānanda, ",
  "dn16:3.6.3": "at your convenience.” ",
  "dn16:3.6.4": "“Yes, sir,” replied Ānanda. He rose from his seat, bowed, and respectfully circled the Buddha, keeping him on his right, before sitting at the root of a tree close by. "
}
