{
  "sn56.11:0.1": "Saṁyutta Nikāya 56.11 ",
  "sn56.11:0.2": "Chapter of the Turning of the Wheel of Dhamma",
  "sn56.11:0.3": "Sutta of the Turning of the Wheel of Dhamma",
  "sn56.11:1.1": "One time the Blessed One in Vārāṇasī dwells, in Isipatana, in Migadāya.",
  "sn56.11:1.2": "There the Blessed One to the group of five bhikkhus addressed:",
  "sn56.11:2.1": "“Two boundaries, bhikkhus, by one gone forth should not be approached.",
  "sn56.11:2.2": "Which two?",
  "sn56.11:2.3": "This and that connection in desires with pleasantness of desires low, ordinary, common, ignoble, not having meaning, this and that connection with self-mortification painful, ignoble, not connected with purpose-benefit-good.",
  "sn56.11:2.4": "These, bhikkhus, both boundaries not approached, the middle practice comprehended by the Tathāgata, vision-giving, knowledge-giving, that to equanimity, to knowing, to awakening, to Nibbana leads.",
  "sn56.11:3.1": "And what is it, bhikkhus, the middle practice comprehended by the Tathāgata, vision-giving, knowledge-giving, that to equanimity, to knowing, to awakening, to Nibbana leads?",
  "sn56.11:3.2": "It is exactly this noble eight-fold path, namely—",
  "sn56.11:3.3": "right view, right habitual intention, right speech, right motivation to activity, right livelihood, right effort, right rememberence, right unification of the experience.",
  "sn56.11:3.4": "Such is it, bhikkhus, the middle practice comprehended by the Tathāgata, vision-giving, knowledge-giving, that to equanimity, to knowing, to awakening, to Nibbana leads.",
  "sn56.11:4.1": "This, bhikkhus, is the pain noble-truth—",
  "sn56.11:4.2": "Birth is also painful, aging is also painful, sickness is also painful, dying is also painful, union with unloved is painful, separation from loved is painful, what is desired not to obtain, that is also painful, contracted five groups of clinging are painful.",
  "sn56.11:4.3": "This, bhikkhus, is the pain-accumulating noble-truth—",
  "sn56.11:4.4": "It is that clinging-adherence new-involving, joy-passion-accompanied (similar to), here-and-there-delighting-in, namely—",
  "sn56.11:4.5": "desires-clinging, being-clinging, separation-clinging.",
  "sn56.11:4.6": "This, bhikkhus, is the pain-elimination noble-truth—",
  "sn56.11:4.7": "That which is exactly of this clinging without-remainder-without-passion-elimination, willingness to give it up, detachment, freedom, not remaining in it.",
  "sn56.11:4.8": "This, bhikkhus, is to pain-elimination-leading practice noble-truth—",
  "sn56.11:4.9": "it is exactly this noble eight-fold path, namely—",
  "sn56.11:4.10": "right view… right unification of the experience.",
  "sn56.11:5.1": "‘This is the pain noble-truth’ for me, bhikkhus, before unheard doctrines of actuality vision arose, knowledge arose, understanding arose, discernment arose, clarity arose.",
  "sn56.11:5.2": "‘And this pain noble-truth should be fully understood’ for me, bhikkhus, before… arose.",
  "sn56.11:5.3": "‘And this pain noble-truth is fully understood’ for me, bhikkhus, before unheard doctrines of actuality vision arose, knowledge arose, understanding arose, discernment arose, clarity arose.",
  "sn56.11:6.1": "‘This is the pain-accumulating noble-truth’ for me, bhikkhus, before unheard doctrines of actuality vision arose, knowledge arose, understanding arose, discernment arose, clarity arose.",
  "sn56.11:6.2": "‘And this pain-accumulating noble-truth should be abandoned (done away with)’ for me, bhikkhus, before… arose.",
  "sn56.11:6.3": "‘And this pain-accumulating noble-truth is abandoned’ for me, bhikkhus, before unheard doctrines of actuality vision arose, knowledge arose, understanding arose, discernment arose, clarity arose.",
  "sn56.11:7.1": "‘This is the pain-elimination noble-truth’ for me, bhikkhus, before unheard doctrines of actuality vision arose, knowledge arose, understanding arose, discernment arose, clarity arose.",
  "sn56.11:7.2": "‘And this pain-elimination noble-truth should be realized (witnessed with one's own eyes)’ for me, bhikkhus, before… arose.",
  "sn56.11:7.3": "‘And this pain-elimination noble-truth is realized’ for me, bhikkhus, before unheard doctrines of actuality vision arose, knowledge arose, understanding arose, discernment arose, clarity arose.",
  "sn56.11:8.1": "‘This is the to pain-elimination leading practice noble-truth’ for me, bhikkhus, in before unheard doctrines of actuality vision arose, knowledge arose, understanding arose, discernment arose, clarity arose.",
  "sn56.11:8.2": "‘And this to pain-elimination leading practice noble-truth should be developed’ for me, bhikkhus, before… arose.",
  "sn56.11:8.3": "‘And this to pain-elimination leading practice noble-truth is developed’ for me, bhikkhus, before unheard doctrines of actuality vision arose, knowledge arose, understanding arose, discernment arose, clarity arose.",
  "sn56.11:9.1": "And as long as for me, bhikkhus, of these four noble-truths in three cycles, twelvefold as-(it)-is knowledge-vision had not become well purified, so long I, bhikkhus, in the world with devas, with Māra, with Brahmā, with samaṇa-brāhmaṇas, with the generation of kings (devas)-humans, that ‘awakened in unsurpassed right awakening’ did not acknowledge.",
  "sn56.11:10.1": "But when for me, bhikkhus, of these four noble truths in three cycles, twelvefold as-it-is knowledge-vision had become well purified, then I, bhikkhus, in the world with devas, with Māra, with Brahmā, with samaṇa-brāhmaṇas, with the generation of kings (devas)-humans, that ‘awakened in unsurpassed right awakening’ acknowledged.",
  "sn56.11:10.2": "Knowledge then for me and vision arose:",
  "sn56.11:10.3": "‘unshakable is my liberation, this is the final-extreme birth, henceforth there is no repeated involvement-individual existence.’”",
  "sn56.11:10.4": "This the Blessed One spoke.",
  "sn56.11:10.5": "Pleased the group of five bhikkhus the Blessed One’s speech rejoiced in.",
  "sn56.11:11.1": "And with this spoken explanation for the Venerable Koṇḍañña the dustless stainless dhamma-vision arose:",
  "sn56.11:11.2": "“Whatever phenomenon of accumulating, all that is phenomenon of elimination.”",
  "sn56.11:12.1": "And in the turned Wheel of Dhamma the local devas proclaimed:",
  "sn56.11:12.2": "“Behold by the Blessed One in Vārāṇasī, in Isipatana, in Migadāya, the unsurpassed Wheel of Dhamma has been turned, which cannot be stopped by samaṇa, or by brāhmaṇa, or by deva, or by Māra, or by Brahmā, or by anyone in the world.”",
  "sn56.11:12.3": "Having heard the sound of the local devas, the devas of the Four Great Kings proclaimed:",
  "sn56.11:12.4": "“Behold by the Blessed One in Vārāṇasī, in Isipatana, in Migadāya, the unsurpassed Wheel of Dhamma has been turned, which cannot be stopped by samaṇa, or by brāhmaṇa, or by deva, or by Māra, or by Brahmā, or by anyone in the world.”",
  "sn56.11:12.5": "Having heard the sound of the devas of the Four Great Kings, the devas of Thirty-three…",
  "sn56.11:12.6": "the devas of Yāmā…",
  "sn56.11:12.7": "the devas of Tusitā…",
  "sn56.11:12.8": "the devas of Nimmānaratī…",
  "sn56.11:12.9": "the devas of Paranimmitavasavattī…",
  "sn56.11:12.10": "the devas of the multitude of Brahmā proclaimed:",
  "sn56.11:12.11": "‘Behold by the Blessed One in Vārāṇasī, in Isipatana, in Migadāya, the unsurpassed Wheel of Dhamma has been turned, which cannot be stopped by samaṇa, or by brāhmaṇa, or by deva, or by Māra, or by Brahmā, or by anyone in the world.’",
  "sn56.11:13.1": "And in a second, in a moment, instantly that sound reached the Brahmā world-realm of light.",
  "sn56.11:13.2": "And this ten-thousandfold sphere (dhātu) of the world trembled, quivered, shook, and there arose immeasurable, sublime radiance surpassing the divine majesty of devas.",
  "sn56.11:14.1": "And then the Blessed One uttered this utterance:",
  "sn56.11:14.2": "“Understood, oh friend Koṇḍañña, understood, oh friend, Koṇṇḍañña.”",
  "sn56.11:14.3": "Thus to the Venerable Koṇḍañña ‘Koṇḍañña the one who understood’ the name arose.",
  "sn56.11:14.4": "First."
}